# Analyse exploratoire des données

In [4]:
# Importation des librairies
import pandas as pd
import numpy as np
from scipy.stats import *
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
data = pd.read_csv('../output/cleaned_data/data_cleaned.csv', parse_dates=['date'])
data.head()

,date,airline,dep_time,from,time_taken,stop,arr_time,to,price,class
0,2022-02-11,Air India,18:00:00,Delhi,0 days 02:00:00,0-stop,20:00:00,Mumbai,25612,business
1,2022-02-11,Air India,19:00:00,Delhi,0 days 02:15:00,0-stop,21:15:00,Mumbai,25612,business
2,2022-02-11,Air India,20:00:00,Delhi,1 days 00:45:00,1-stop,20:45:00,Mumbai,42220,business
3,2022-02-11,Air India,21:25:00,Delhi,1 days 02:30:00,1-stop,23:55:00,Mumbai,44450,business
4,2022-02-11,Air India,17:15:00,Delhi,0 days 06:40:00,1-stop,23:55:00,Mumbai,46690,business

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300182 entries, 0 to 300181
Data columns (total 10 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        300182 non-null  datetime64[ns]
 1   airline     300182 non-null  object
 2   dep_time    300182 non-null  object
 3   from        300182 non-null  object
 4   time_taken  300182 non-null  object
 5   stop        300182 non-null  object
 6   arr_time    300182 non-null  object
 7   to          300182 non-null  object
 8   price       300182 non-null  int64
 9   class       300182 non-null  object
dtypes: datetime64[ns](1), int64(1), object(8)
memory usage: 22.9+ MB

## Analyse Univariée

### Variables qualitatives